/*Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами. Если это возможно, выведите строку YES, иначе выведите строку NO.
Треугольник — это три точки, не лежащие на одной прямой.*/

#include <iostream>

using namespace std;

int main() {
	int a, b, c;
	cin >> a >> b >> c;
	if ((a+b>c) && (a+c>b) && (b+c>a)) {
		cout << "YES";
	}
	else {
		cout << "NO";
	}
}
